<?php

$fis_data_text = '{"status":1,"data":{"list":[{"id":"13","title":"招聘人员选拨在面试中常犯的错误有（ ）","factors_id":"24","item":"A、对比效应 B、目的不明确 C、不清楚合格者应具备的条件 D、面试缺少整体结构 E、偏见影响面试","type":"2","contitem":["A、对比效应","B、目的不明确","C、不清楚合格者应具备的条件","D、面试缺少整体结构","E、偏见影响面试"]},{"id":"14","title":"确定员工的初始工资具体依照以下哪些规定执行？（　）","factors_id":"24","item":"A、完全由酒店决定 B、确定与职位相适合的工资范围 C、与内部其它相同\/相似岗位的员工工资 D、资历、工作经历、目前工资及应聘人要求的工资都要综合考虑","type":"2","contitem":["A、完全由酒店决定","B、确定与职位相适合的工资范围","C、与内部其它相同\/相似岗位的员工工资","D、资历、工作经历、目前工资及应聘人要求的工资都要综合考虑"]},{"id":"17","title":"在酒店招聘过程中，下列哪些情况需要酒店人力资源部考虑并判断的？（　）","factors_id":"24","item":"A、证明人没有给出任何损贬性信息或评估 B、证明人没有做出任何诽谤性评论 C、证明人没有违反法律 D、证明人没有给出任何书面证明","type":"2","contitem":["A、证明人没有给出任何损贬性信息或评估","B、证明人没有做出任何诽谤性评论","C、证明人没有违反法律","D、证明人没有给出任何书面证明"]}]}}';

if ( isset($GLOBALS['fcData']) ) {
	$fis_data = $GLOBALS['fcData'];
} else {
	$fis_data = json_decode($fis_data_text, true);
}
$fis_data['GET'] = $_GET;
$fis_data['site_type'] = $_GET['site_type'];